# Guido van Rossum <guido@python.org>

def step2_umbrella():
    s = '\N{Droplet}'
    img = f"""   
                    {s}                    {s}                    
          {s}                     $                 
                            $$$$$$$$$                   {s}             
                 {s}      $$$$$$$$$$$$$$$$$                                   
                    $$$$$$$$$$$$$$$$$$$$$$$$$     {s}                   
         {s}      $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$             {s}      
            $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$                
 {s}     $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$                         
    $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$    {s}       
    $         $         $         $         $       $       $
    $         $         $         $         $       $       $
                                   ___
                               ,-""   `.            
                             ,'  _    e )`-._           
                            /  ,' `-._...===-'      
                           /  /                 
                          /  ;              
              _.--.__    /   ;    $          
 (`._    _.-""       "--'    |              
 <_  `-""                     \   $               
  <`-                          :            
   (__   <__.                  ;  $           
     `-.   '-.__.      _.'    /         
        \      `-.__,-'    _,'    $   
         `._    ,    /__,-'         
            ""._\__,'< <____      $   
                 | |  `----.`.       $   
                 | |        \ `.  $  $     
                 ; |___      \-``  $$
                 \   --<
                  `.`.<
                    `-'  
    """
    print(img)
    return 

def step2_no_umbrella():
    s = '\N{Droplet}'
    img = f"""
    {s}                     {s}     
                                ,-"" "".    {s}
                  {s}          ,'  ____  `.             
                            ,'  ,'    `.  `._ 
      {s}                  ,'  ,'        \    \         
              _.--.__    /   ;           \    \\    {s}
 (`._    _.-""       "--'    |           (  d _b 
 <_  `-""                     \\    {s}     `-(   \\  
  <`-             {s}           :             `-._\\     
   (__   <__.                  ;        
     `-.   '-.__.      _.'    /               {s}             
        \      `-.__,-'    _,'                        
         `._    ,    /__,-'     {s}                    {s}
            ""._\__,'< <____                            
   {s}             | |  `----.`.
                  | |        \ `.            {s}
                  ; |___      \-``
            {s}    \   --<
                   `.`.<
                     `-`
    """
    print(img)
    return 

def step1():
    print(
        'Утка-маляр 🦆 решила выпить зайти в бар. '
        'Взять ей зонтик? ☂️'
    )
    option = ''
    options = {'да': True, 'нет': False}
    while option not in options:
        print('Выберите: {}/{}'.format(*options))
        option = input()
    
    if options[option]:
        return step2_umbrella()
    return step2_no_umbrella()

if __name__ == '__main__':
    step1()